In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame([[6,2,np.nan,3],
                   [np.nan,3,np.nan,8],
                   [np.nan,np.nan,np.nan,np.nan],
                   [1,3,5,0]], columns=list('ABCD'))
df

     A    B    C    D
0  6.0  2.0  NaN  3.0
1  NaN  3.0  NaN  8.0
2  NaN  NaN  NaN  NaN
3  1.0  3.0  5.0  0.0

In [3]:
df.isnull()

       A      B      C      D
0  False  False   True  False
1   True  False   True  False
2   True   True   True   True
3  False  False  False  False

In [4]:
df.isnull().sum()

A    2
B    1
C    3
D    1
dtype: int64

In [5]:
df.dropna(thresh=3)

     A    B    C    D
0  6.0  2.0  NaN  3.0
3  1.0  3.0  5.0  0.0

In [6]:
df.dropna(how='all')

     A    B    C    D
0  6.0  2.0  NaN  3.0
1  NaN  3.0  NaN  8.0
3  1.0  3.0  5.0  0.0

In [7]:
df.dropna(how='any')

     A    B    C    D
3  1.0  3.0  5.0  0.0

In [8]:
df.dropna(subset=['C'])

     A    B    C    D
3  1.0  3.0  5.0  0.0

In [9]:
df.dropna(axis=0)

     A    B    C    D
3  1.0  3.0  5.0  0.0

In [10]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [11]:
df = pd.DataFrame([['green','M',10.1],
                   ['red','L',13.5],
                    ['blue','XL',15.3]], columns=['color','size','price'])
df

   color size  price
0  green    M   10.1
1    red    L   13.5
2   blue   XL   15.3

In [12]:
size_map = {'XL':3,
           'L':2,
           'M':1}

df['size'] = df['size'].map(size_map)
df

   color  size  price
0  green     1   10.1
1    red     2   13.5
2   blue     3   15.3

In [13]:
color_map = {label: idx for idx, label in enumerate(np.unique(df['color']))}
color_map

{'blue': 0, 'green': 1, 'red': 2}

In [14]:
df['color'] = df['color'].map(color_map)
df

   color  size  price
0      1     1   10.1
1      2     2   13.5
2      0     3   15.3